import tools

input_params = {
    'w_out': 5,         # c^(-1)
    'e_out': 36,        # c^(-2)
    'J_load': 0.015,    # kgm^2
    'phi_out': 120,     # \deg
    'd_connect': 50     # mm
}

engine = {
    'name': 'ДГ-5ТА',
    'N': 5,             # Вт
    'n': 6000,          # об\мин
    'Mn': 10,           # Н*мм
    'Mstart': 22,       # Н*мм
    'Jr': 40*10**(-8),  # кгм^2
    'D': 61,            # мм
    'L': 142,           # мм
    'U': 36,
}

materials = {
    'wheel': {
        'name': 'сталь 45',
        'sigma_b': 580,     # предел прочности
        'sigma_t': 360,     # предел текучести
        'sigma_1': 203,     # предел выносливости
        'sigma_f': 0,       # изгибное напряжение
        'sigma_H': 0,       # контактное напряжение
    },
    'gear': {
        'name': 'сталь 40Х',
        'sigma_b': 1000,     # предел прочности
        'sigma_t': 830,      # предел текучести
        'sigma_1': 430,
        'sigma_f': 0,        # изгибное напряжение
        'sigma_H': 0,        # контактное напряжение
    }
}

minModule = [0.4]*2+[0.5]*2+[0.6]   # влияем на общий диаметр колёс
minZ = [25]*4 + [35]
output_shaft_margin = 10            # запас на стенки вала и зубья для выходного колеса

# i = [1.51, 1.62, 2.63, 4.27, 4.58]

Yf = 8
# M = [7, 10, 15, 39, 160, 520]    #   Н*мм
Ybm = 8
kpdOp = 0.98

eps_d = 2
eps_module = 1

springs = {
    '173': {
        'name': '№173 II класса 2 разряда',
        'P3':   tools.kgs2newton(1.7),    # кгс = Н/9.8027
        'd':    0.45,     # мм
        'D':    2.2,      # мм
        'z1':   tools.kgs2newton(7.651),      # кгс/мм
        'f3':   0.222,      # мм
        'L':    17,     # мм
    },
    '175': {
        'name': '№175 II класса 2 разряда',
        'P3':   tools.kgs2newton(1.7),    # кгс = Н/9.8027
        'd':    0.56,     # мм
        'D':    4.2,      # мм
        'z1':   tools.kgs2newton(2.039),      # Н/мм
        'f3':   0.834,      # мм
        'L':    16,     # мм
    },
}

loft_wheel = {
    'z': 0,
    'm': 0,
    'M': 0,
    'spring': springs['173'],
    'A': 35,      # мм, расстояние от пружины до центра
    'xi': 2,      # запас момента упругости пружин
    'd': 0.05,    # коэффициент ограничения максимальной деформации
    'n': 4,       # число зубьев относительного смещения половин колеса
}
